system "sudo chown -R $(whoami):admin $(brew --prefix)/*"
system "cd $(brew --repository) && git checkout master"

tap "thoughtbot/formulae"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/bundle"
tap "puma/puma"
tap "kylef/formulae"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "InstantClientTap/instantclient"
tap "universal-ctags/universal-ctags"
tap "heroku/brew"

system "brew update"
system "brew upgrade --fetch-HEAD"

brew "mas"
mas "Xcode", id: 497799835
system "sudo xcodebuild -license"
system "if ! [[ $(xcode-select -v | grep -E '^xcode-select version \d+\.$') ]]; then xcode-select --install; fi"

# sleuthkit
cask "adoptopenjdk"
cask "java"
cask "adoptopenjdk8"
brew "sleuthkit"

brew "cmake"
brew "git"
brew "tig"
brew "hub"
brew "git-lfs"
brew "wget"
brew "curl"
brew "mysql", link: false, conflicts_with: ["mysql@5.7"]
brew "mysql@5.7", link: true, conflicts_with: ["mysql"]
brew "redis"
brew "memcached"
brew "node"
brew "node-build"
brew "nodenv"
brew "watchman"
brew "sqlite"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-navigation-tools"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zplug"
brew "terminal-notifier"
brew "source-highlight"
brew "macvim", link: false, conflicts_with: ["vim"]
brew "vim", link: true, conflicts_with: ["macvim"]
brew "luarocks"
brew "neovim"
brew "bash-completion"
brew "imagemagick", link: false, conflicts_with: ["imagemagick@6"]
brew "imagemagick@6", link: true, conflicts_with: ["imagemagick"]
brew "sl"
brew "bash"
brew "heroku"
brew "pyenv"
brew "jq"
brew "ansible"
brew "watch"
brew "osquery"
brew "direnv"
brew "coreutils"
brew "gnu-sed"
brew "ttyrec"
brew "dnsmasq"
brew "ag"
brew "spark"
brew "tmux"
brew "screen"
brew "reattach-to-user-namespace"
# brew "gnupg"
brew "grc"
brew "rmtrash"
brew "tor"
brew "nkf"
brew "automake"
brew "fontforge"
brew "p7zip"
brew "pick"
brew "universal-ctags", args:["HEAD"]
brew "tree"
brew "packer"
brew "packer-completion"
brew "chrome-cli"
brew "cscope"
brew "postgresql"
brew "parallel"
brew "nmap"
brew "go"
brew "goenv"
brew "slackcat"
brew "lame"
brew "vault"
brew "googler"
brew "translate-shell"
brew "yank"
brew "sshrc"
brew "v8"
brew "git-secrets"
brew "sslscan"
brew "diff-so-fancy"
brew "mas"
brew "wireshark"
brew "git-when-merged"
brew "fortune"
brew "cowsay"
brew "figlet"
brew "asciiquarium"
brew "cmatrix"
brew "pow"
brew "yarn"
brew "nss"
brew "cheat"
brew "ripgrep"
brew "ios-sim"
brew "swift"
brew "swiftenv"
brew "swiftlint"
brew "terraform"
brew "x265"
brew "puma-dev"
brew "stunnel"
brew "sqlmap"
brew "rust"
brew "plenv"
brew "shyaml"
brew "gpg"
brew "shellcheck"
brew "ghq"
brew "flow"
brew "ocaml", link: false
brew "jenv"
brew "kotlin"
brew "rcm"
brew "ansible-lint"
brew "firebase-cli"
brew "logrotate"
brew "pre-commit"
brew "terragrunt"
brew "kibana"
brew "protobuf", link: true, conflicts_with: ["mysql", "mysql@5.7"]
brew "pv"
brew "ccze"
brew "git-secrets"
brew "testssl"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "gradle"
brew "azure-cli"
brew "bench"
brew "circleci"
brew "eslint"
brew "iso-codes"
brew "ssh-copy-id"
brew "ssh-permit-a38"
brew "swiftformat"
brew "terraform_landscape"
brew "thors-serializer"
brew "uriparser"
brew "util-linux"
brew "watchexec"
brew "xcodegen"
brew "webpack"
brew "elixir"
brew "elm"
brew "erlang"
brew "ghostscript"
brew "json11"
brew "duck"
brew "doctl"
brew "git-quick-stats"
brew "elasticsearch"
brew "peco"
brew "fzf"
brew "coffeescript"
brew "zlib"
brew "awscli"
brew "clamav"
brew "whois"
brew "bettercap"
brew "lsd"
brew "serverless"
brew "amazon-ecs-cli"
brew "emojify"
brew "jsonpp"

# for ruby
brew "openssl"
brew "readline"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"

brew "libressl"

# for nokogiri
brew "libxml2", link: false
brew "libxslt", link: false
brew "libiconv", link: false

# for oracle
brew "instantclient-basic"
brew "instantclient-sqlplus"
brew "instantclient-sdk"

# cask
cask "dropbox"
cask "google-japanese-ime"
cask "vagrant"
cask "virtualbox"
cask "google-chrome"
cask "firefox"
cask "firefox-developer-edition"
cask "flash-npapi"
cask "evernote"
cask "slack"
cask "skitch"
cask "geektool"
cask "xquartz"
cask "skype"
cask "knock"
cask "licecap"
cask "sublime-text"
cask "atom"
cask "encryptme"
cask "karabiner-elements"
cask "slate"
cask "google-hangouts"
cask "dash"
cask "reflector"
cask "disk-inventory-x"
cask "itrash"
cask "cyberduck"
cask "inssider"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "betterzip"
cask "suspicious-package"
cask "packages"
cask "qlcolorcode"
cask "qlimagesize"
cask "iterm2"
cask "gyazo"
cask "0xed"
cask "alfred"
cask "githubpulse"
cask "github"
cask "paparazzi"
cask "box-sync"
cask "google-chrome-canary"
cask "soundflower"
cask "vlc"
cask "chrome-remote-desktop-host"
cask "near-lock"
cask "vivaldi"
cask "lacona"
cask "wireshark-chmodbpf"
cask "sketch"
cask "flinto"
cask "blisk"
cask "gitter"
cask "flux"
cask "docker"
cask "1password"
cask "gpg-suite"
cask "fliqlo"
cask "google-featured-photos"
cask "google-earth-pro"
cask "zoomus"
cask "spotify"
cask "chromedriver"
cask "microsoft-remote-desktop-beta"
cask "mono-mdk"
cask "dotnet"
cask "visual-studio"
cask "visual-studio-code"
cask "android-sdk"
cask "android-studio"
cask "dynamodb-local"
cask "phantomjs"
cask "discord"

# fonts
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"

# xquartz required
brew "diff-pdf"

system "brew cu --all --cleanup --yes"

system "brew cleanup --prune=0 -s"
